// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3

// Console.WriteLine("Введите первое число");
// double Num1 = double.Parse(Console.ReadLine()!);
// Console.WriteLine("Введите второе число");
// double Num2 = double.Parse(Console.ReadLine()!);

// if(Num1 > Num2){
//     Console.WriteLine("max = " + Num1);}
// if(Num1 == Num2){
//     Console.WriteLine("max = " + Num1);}
// else{
//     Console.WriteLine("max = " + Num2);}


// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22

// Console.WriteLine("Введите первое число");
// double Num1 = double.Parse(Console.ReadLine()!);
// Console.WriteLine("Введите второе число");
// double Num2 = double.Parse(Console.ReadLine()!);
// Console.WriteLine("Введите третье число");
// double Num3 = double.Parse(Console.ReadLine()!);

// double max;
// max = Num1;
// for (int i = 1; i < 3; i++){
// if(Num2 > Num1)
//     max = Num2; 

// if(Num3 > Num2)
//     max = Num3;
// }
// Console.WriteLine(max);


// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// 4 -> да
// -3 -> нет
// 7 -> нет

// Console.WriteLine("Введите число");
// int Num1 = int.Parse(Console.ReadLine()!);
//  if (Num1 % 2==0)
//  {
//     Console.WriteLine("Число четное");
//  }
//  else
//  {
//     Console.WriteLine("Число не четное");
//     }